/* 
 * Капырина Алина Андреевна, ЗИТ-21
 * номер зач.книжки: 21-674.
 * Практическая работа №3. 
 * Вариант 10. Литература.
 
 * Создать программу на языке Java для определения класса в некоторой предметной области. Описать свойства, конструктор,
 * методы геттеры/сеттеры, перекрыть метод toString() для выводв полной информации об объекте в отформатированном виде.
 
 */

public Literature_2 {
    public static void main(String[] attr) {
        Literature Сaptainsdaughter = new Literature(123, "romance", "Сaptain's daughter", 1836, "contemporary");
        Сaptainsdaughter.setAuthor("Alexander Pushkin");
        Сaptains daughter.setNumberOfPages(57);
        System.out.println(Сaptainsdaughter);
        System.out.println(Сaptainsdaughter.getType());
    }
}